CSI API ETABS v1
cDCompColAISC360_22 Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDCompColAISC360_22
Public Interface cDCompColAISC360_22
Dim instance As cDCompColAISC360_22
public interface class cDCompColAISC360_22
type cDCompColAISC360_22 =  interface end
The cDCompColAISC360_22 type exposes the following members.
Methods
Name | Description
GetOverwrite
 Retrieves the value of a composite column design overwrite item.
GetPreference
 Retrieves the value of a composite column design preference item.
SetOverwrite
 Sets the value of a composite column design overwrite item.
SetPreference
 Sets the value of a composite column design preference item.
Top
See Also
Reference
ETABSv1 Namespace